UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
/*H***************************************************************************
*
* $Archive:: /TI/product/F28xxSerialFlash/src_host/f280xxprg.c                $
* $Revision:: 3                                                              $
* $Date:: 11/14/03 10:20a                                                    $
* $Author:: Tonyc                                                            $
*
* HISTORY:
*
*  Jan. 25, 2008: Changed name to f280xxprg.c for differentiation
*                 between different 28x devices because f2833x no longer
*                 matches f28xx password location convention.(C. Peng)
*
*  Mar. 20, 2007: Added support for 4800, 2400, 1200, and 115200 baud.
*                 (D. Alter)
*
*  June 27, 2005: Ported to F280x from original F281x based f28xxprg.c.
*                 Added password match flow download before main flash
*                 API kernel download. (D. ALTER)
*
* DESCRIPTION:
*
* GLOBALS
*
* PUBLIC FUNCTIONS:
*
* PRIVATE FUNCTIONS:
*
* USAGE/LIMITATIONS:
*
* NOTES:
*   Incoming Options:
*
*   EmulatorId
*   EmuPortAddr
*   EmuBaudRate
*   EmuBoardFileName
*   EmuProcessorName
*
*
*   PrgEraseFileName
*   PrgEraseTimeout
*   PrgEraseOption1
*   PrgEraseOption2
*   PrgEraseOption3
*   PrgEraseOption4
*
*   PrgProgrammingFileName
*   PrgFlashDataFileName
*   PrgProgrammingTimeout
*   PrgProgrammingOption1
*   PrgProgrammingOption2
*   PrgProgrammingOption3
*   PrgProgrammingOption4
*
*   PrgVerifyFileName
*   PrgVerifyTimeout
*   PrgVerifyOption1
*   PrgVerifyOption2
*   PrgVerifyOption3
*   PrgVerifyOption4
*
*
* (C) Copyright 2003 by Spectrum Digital Incorporated
* All rights reserved
*
*H***************************************************************************/
#define f280xxprg_c

/*---- compilation control switches ----------------------------------------*/
//#define INCL_COFFLIB
#define DO_READBACK_VERIFY
#define USE_THREADS

/*****************************************************************************
* INCLUDE FILES
*****************************************************************************/
/*---- system and platform files -------------------------------------------*/
#ifdef _WIN32
    #if (_MSC_VER >= 900 )
       #define	WIN32_LEAN_AND_MEAN
       #define 	INC_OLE2
       #define	NOSERVICE
    #endif

    #include <windows.h>
    #include <process.h>

    //#define EXPORT __declspec(dllexport)
    #define EXPORT
#endif

#include <stdio.h>

/*---- program files -------------------------------------------------------*/
#include "f28xxsio.h"
#include "coff.h"
#include "coffdefs.h"
#include "cofflib.h"
#include "f28xxpkt.h"
#include "flash.h"
#include "f280xxprg.h"

/*****************************************************************************
* EXTERNAL REFERENCE
*****************************************************************************/
/*---- data declarations ---------------------------------------------------*/
/* Bootloader/header defines -----------------------------------------------*/
#define OFFSET               1
#define BOOT_HEADER_SIZE    22
#define SECTION_HEADER_SIZE  6

// Sleep( Timeout * XXX_TIMEOUT_MULTIPLIER )
// The result is in milliseconds
//
// Testing shows that it takes about 2 seconds per sector to erase.
// For compatibility with emulator based SDFlash the timeout is
// set to 200.  So we will use 200 to represent 20 seconds for
// 10 sectors.  So the delay in milliseconds is 20,000 or
// 200*10 Sectors *10 (multiplier) == 20 seconds.
//
#define SLEEP_INTERVAL  100

#define ERASE_TIMEOUT( NumSections )  (Opts.PrgEraseTimeout * NumSections * 10)
#define PROGRAM_TIMEOUT( Length ) (Opts.PrgProgrammingTimeout )
#define VERIFY_TIMEOUT( Length )  (Opts.PrgVerifyTimeout )

#define MEMORY_TIMEOUT( Length ) (Length/100)

typedef struct _f28xxprg_opts
{
    // Possible inputs from SDFLASH
    DWORD   EmulatorId;
    DWORD   EmuPortAddr;
    DWORD   EmuBaudRate;
    char    EmuBoardFileName[MAX_PATH+1];
    char    EmuProcessorName[MAX_PATH+1];

    char    PrgBootLoadFileName[MAX_PATH+1];
    DWORD   PrgSkipBootLoad;

    char    PrgEraseFileName[MAX_PATH+1];
    DWORD   PrgEraseTimeout;
    DWORD   PrgEraseOption1;
    DWORD   PrgEraseOption2;
    DWORD   PrgEraseOption3;
    DWORD   PrgEraseOption4;

    char    PrgProgrammingFileName[MAX_PATH+1];
    char    PrgFlashDataFileName[MAX_PATH+1];
    DWORD   PrgProgrammingTimeout;
    DWORD   PrgProgrammingOption1;
    DWORD   PrgProgrammingOption2;
    DWORD   PrgProgrammingOption3;
    DWORD   PrgProgrammingOption4;

    char    PrgVerifyFileName[MAX_PATH+1];
    DWORD   PrgVerifyTimeout;
    DWORD   PrgVerifyOption1;
    DWORD   PrgVerifyOption2;
    DWORD   PrgVerifyOption3;
    DWORD   PrgVerifyOption4;
} F28XXPRG_OPTS;

typedef enum _optiontype
{
    STR  = 0,            // Natural space for processor, !Harvard
    HEX,                 // Program space
    DEC,                 // Data space
    YES                  // I/O space
}OPTION_TYPE;

typedef struct _option_table
{
    char *        Name;
    OPTION_TYPE   Type;
    void *        pDest;
}OPTION_TABLE;

/*---- function prototypes -------------------------------------------------*/

/*****************************************************************************
* PUBLIC DECLARATIONS
*****************************************************************************/

/*****************************************************************************
* PRIVATE DECLARATIONS
*****************************************************************************/
/*---- context -------------------------------------------------------------*/
#define MAX_PRINT_BUFFER   1024

/*---- data declarations ---------------------------------------------------*/
static char                  PrintBuffer[MAX_PRINT_BUFFER] = {0};
static volatile int          ExeStatus                     = PRG_SUCCESS;
static volatile int          ThreadTerminate               = FALSE;
static DWORD                 ThreadHandle                  = 0;
static DWORD                 dwThreadID                    = 0;
//CRITICAL_SECTION             CritSect                      = {0};

static int                   Connected                     = 0;
static DWORD                 PrgHandle                     = 0;
static PRG_MESSAGE_CALLBACK  pfTestPrintMsg                = NULL;
static F28XXPRG_OPTS         Opts;
static char                  SendBuf[MSG_PACKET_SIZE+10];
static char                  RecvBuf[MSG_PACKET_SIZE+10];

