UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
	CoffBufferSize += 10;

    pCoffData = (unsigned char *)malloc( CoffBufferSize );

	if ( pCoffData == (unsigned char *)NULL )
    {
        Success = PRG_FAIL;
        goto EXIT_LoadBootCoffImage;
    }

    pSectionHdr = (TI_SCNHDR  *)(pCoffHndl->FileInfo->sect_hdrs);
    NumSections = pCoffHndl->FileInfo->file_hdr.f_nscns;
    TestPutDiagMsg("\nLoading %s\n", pCoffName);
    TestPutDiagMsg("Entry point 0x%08lx\n",pCoffHndl->FileInfo->entry_point );

    if( SendBootHeader( pCoffHndl->FileInfo->entry_point ) )
    {
        Success = PRG_FAIL;
        TestPutDiagMsg("Error writing boot header\n");
        goto EXIT_LoadBootCoffImage;
    }

    for( i=1; i<= NumSections; i++ )
    {
        // Loading the boot image can be really slow so allow user to abort
        //
        if( ThreadTerminate == TRUE )
        {
            Success = PRG_FAIL;
            goto EXIT_LoadBootCoffImage;
        }

        if (  COFFR_IsLoadSection( pCoffHndl, (short)i )
                                  != COFF_NOLOADSECT_ERR )
        {
            NumToRead = LOCTOBYTE(pCoffHndl, pSectionHdr->s_size);

            memset(pCoffData,0x00,NumToRead+1);

			COFFR_GetSectData( pCoffHndl,
							  (short)i,
							  pCoffData,
							  0,
							  NumToRead,
							  &ActualBytesRead );

            TestPutDiagMsg("Section Address = 0x%08lx, Number of words = %d",
                                  (DWORD)pSectionHdr->s_vaddr,
                                  (DWORD)(ActualBytesRead/2));

            if(ActualBytesRead & 1 )
                TestPutDiagMsg(", Pad section\n");
            else
                TestPutDiagMsg("\n");

            if( SendSectionHeader( pSectionHdr->s_vaddr, pSectionHdr->s_size ))
            {
                Success = PRG_FAIL;
                TestPutDiagMsg("Error writing section header\n");
                goto EXIT_LoadBootCoffImage;
            }
            if( SendSectionData( pSectionHdr->s_size, pCoffData ))
            {
                Success = PRG_FAIL;
                TestPutDiagMsg("Error writing section data\n");
                goto EXIT_LoadBootCoffImage;
            }
        }
        pSectionHdr++;
    }
    // Send the trailer to indicate no more section data
    memset(pCoffData,0x00,10 );
    SendSectionData( 1, pCoffData );

EXIT_LoadBootCoffImage:

    if( pCoffData != NULL )
        free( pCoffData );

    if( pCoffHndl != NULL )
        COFFR_FileClose( pCoffHndl );

    return( Success );
}


/*F***************************************************************************
* NAME: void ParseOption( char * pString )
*
* DESCRIPTION: Parse options passed in and fill in the appropriate fields
*
* NOTES:  This is really simple method that uses a option string table.
*         You add options by including new entries into the table.
*
*F***************************************************************************/
static void
ParseOption( char * pString )
{
    char * pArg;
    int    Index;
    int    Abort;

    pArg = strchr( pString,(int)'=' );

    if( pArg == NULL )
        return;

    *pArg = '\0';
    pArg++; // Get past = sign

    Index = 0;
    Abort = 0;
    while( (Abort == 0 ) && (OptionTable[Index].Name != NULL) )
    {
        if( strcmp( pString, OptionTable[Index].Name ) == 0 )
        {
            switch( OptionTable[Index].Type )
            {
                case STR:
                    memset(OptionTable[Index].pDest,0,MAX_PATH+1);
                    if( *pArg != '\0' )
                        strncpy((char *)OptionTable[Index].pDest, pArg, MAX_PATH );
                    Abort = 1;
                    break;

                case HEX:

                    sscanf( pArg,"%08lx", (DWORD *)OptionTable[Index].pDest );
                    Abort = 1;
                    break;

                case DEC:
                    sscanf( pArg,"%d", (DWORD *)OptionTable[Index].pDest );
                    Abort = 1;
                    break;

                case YES:
                    if( strcmp( pArg, "YES" ) == 0 )
                        *(DWORD *)OptionTable[Index].pDest = TRUE;
                    else
                        *(DWORD *)OptionTable[Index].pDest = FALSE;
                    Abort = 1;
                    break;
            }
        }
        Index++;
    }
}


static int
PingChannel()
{
    char    *pSbuf;
    DWORD   i;
    DWORD   NumXfer;

    pSbuf = SendBuf;
    Put16(pSbuf,CMD_LOOPBACK ); // Cmd
    // Dummy data
    for(i=0; i<SIZE_COMMAND_BLOCK;i++)
        pSbuf[i] = (char)i;

    NumXfer = PktSendMsg( SendBuf,SIZE_COMMAND_BLOCK  );
    if( NumXfer == 0 )
    {
        TestPutDiagMsg("Send packet rejected\n");
        return( PRG_FAIL );
    }

    NumXfer = PktRecvMsg( RecvBuf, MSG_BODY_SIZE );
    if( NumXfer < 2 )
    {
        TestPutDiagMsg("Invalid return packet\n");
        return( PRG_FAIL );
    }
    for( i=0; i<10; i++ )
    {
        if( (char)(RecvBuf[i+2] & 0x00FF ) != (char)(i) )
        {
            TestPutDiagMsg("Invalid return packet\n");
            return( PRG_FAIL );
        }
    }
    return( PRG_SUCCESS );

}

/*F***************************************************************************
* NAME: int PRG_Init( DWORD *pHandle )
*
* DESCRIPTION:  Init all the statics so we can get all our data items back
*               to a default state.
*
* NOTES:  The code as written requires that PRG_Init() be the first function
*         called so that you obtain a handle.  PRG_Init() should NOT be
*         called again until there is a successfull call to PRG_Close().
*         PRG_Close() should free up any outstanding resources.
*
*F***************************************************************************/
EXPORT int
PRG_Init( DWORD *pHandle )
{
    if( pHandle == NULL )
        return( PRG_FAIL );

    // Init all the statics.
    SioInit();
    PktInit();
    PrgInit();

    *pHandle = PrgHandle;

    return( PRG_SUCCESS );
}

/*F***************************************************************************
* NAME:  int PRG_SetOptions( DWORD Handle, const char * pArgString )
*
* DESCRIPTION:  Pass in user options.
*
* NOTES: Rules:
*           1) String is null terminated
*           2) Multiple options may be passed
*           3) Multiple options are comma delimited
*           4) Only options that match the OptionTable are valid. Invalid
*              options are simply ignored.
*
*F***************************************************************************/
EXPORT int
PRG_SetOptions( DWORD Handle, const char * pArgString )
{
    int     Length;
    int     SubStrLength;
    char *  pHead    = NULL;
    char *  pCurrent = NULL;
    char *  pComma;

    if( pArgString == NULL )
        return( PRG_FAIL );

