UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
    Length = strlen( pArgString );
    if( Length > 0 )
    {
        // Create a temp string and copy into as we modify the string
        // during processing.  Add in couple chars and set to 0 to make
        // handling end of string easier.
        //
        pHead = malloc( Length+5 );
        if( pHead == NULL )
            return( PRG_FAIL );
        memset( pHead,0, Length+2 );
        strcpy( pHead, pArgString );
    }

    pCurrent = pHead;
    while( Length > 0 )
    {
        // Check that we are not at end of string
        if( *pCurrent == '\0' )
            break;

        // Null terminate the substring if multiple items
        pComma = strchr(pCurrent,(char)',');
        if( pComma != NULL )
            *pComma = '\0';

        // If no string to process then break
        SubStrLength = strlen(pCurrent);
        if( SubStrLength == 0 )
            break;

        // Have a string to process
        ParseOption( pCurrent );

        // Index past processed option and possible comma
        pCurrent += (SubStrLength + 1);

        Length -= (SubStrLength + 1);
    }
    if( pHead != NULL )
        free( pHead );

    return( PRG_SUCCESS );

}
/*F***************************************************************************
* NAME:  void PrgOpen( DWORD Handle )
*
* DESCRIPTION:  Open connection to target and bootload if required.
*
* NOTES: Support bootload and no-bootload, thread and no-thread.
*
*F***************************************************************************/
static void
PrgOpen( DWORD Handle )
{
    int     Error;
	char    PortName[20] = "\\.\\";
    int     Baud;
    int     Success = PRG_FAIL;

	int		i;
    char    PrgPasswordMFPath[MAX_PATH+1];
    char    PrgPasswordMFFileName[] = "F280xxPasswordMF.out";

    // Defined in f28xxpkt.c
  	PktInit();

    switch( Opts.EmuPortAddr )
    {

        case 0xC2:
            strcat(PortName,"COM2");
            break;
        case 0xC3:
            strcat(PortName,"COM3");
            break;
        case 0xC4:
            strcat(PortName,"COM4");
            break;
        default:
            strcat(PortName,"COM1");
            break;
    }

	if (Opts.EmuBaudRate != 0)
    {
		switch( Opts.EmuBaudRate )
		{
			case 115200:
				Baud = CBR_115200;
				break;

			case 57600:
				Baud = CBR_57600;
				break;

			case 38400:
				Baud = CBR_38400;
				break;

			case 19200:
				Baud = CBR_19200;
				break;

			case 9600:
				Baud = CBR_9600;
				break;

			case 4800:
				Baud = CBR_4800;
				break;

			case 2400:
				Baud = CBR_2400;
				break;

			case 1200:
				Baud = CBR_1200;
				break;

			default:
				Baud = CBR_38400;
		}
	}
	else
	{
		switch( Opts.PrgEraseOption3)
		{

			case 1:
				Baud = CBR_57600;
				break;

			case 2:
				Baud = CBR_38400;
				break;

			case 3:
				Baud = CBR_19200;
				break;

			case 4:
				Baud = CBR_9600;
				break;

			case 5:
				Baud = CBR_4800;
				break;

			case 6:
				Baud = CBR_2400;
				break;

			case 7:
				Baud = CBR_1200;
				break;

			case 8:
				Baud = CBR_115200;
				break;

			default:
				Baud = CBR_38400;
		}
	}

	// Open the serial port
	Error =  SioOpen( PortName, Baud );
	if( Error )
    {
        TestPutDiagMsg("Could not open serial port %s at %d baudrate\n", PortName, Opts.EmuBaudRate );
        goto EXIT_PrgOpen;
    }

    // After the open we can read back the baud that really got used.  Low
    // level code may be using baud set by windows which could be lower then
    // our baudrate.
    //
    Baud = SioGetCurrentBaudRate();

    // We can skip the bootload if requested by user or if we detect that
    // we have bootloaded already.
    if( Opts.PrgSkipBootLoad == FALSE )
    {
		// Autobaud to get target connected to correct baudrate.  Assume target was in
        // SCI bootloader mode.
        Error = SioAutoBaud( Baud );

		if( Error )
        {
            TestPutDiagMsg("Autobaud failed before loading application\n" );
            goto EXIT_PrgOpen;
        }

        // If user did not specify a boot image then attempt to use the default
        if( Opts.PrgBootLoadFileName[0] == '\0' )
        {
            if( Opts.PrgEraseFileName != '\0' )
                strcpy(Opts.PrgBootLoadFileName,Opts.PrgEraseFileName );
            else if( Opts.PrgProgrammingFileName != '\0' )
                strcpy(Opts.PrgBootLoadFileName,Opts.PrgProgrammingFileName );
            else if( Opts.PrgVerifyFileName != '\0' )
                strcpy(Opts.PrgBootLoadFileName,Opts.PrgVerifyFileName );
            else
                strcpy(Opts.PrgBootLoadFileName,"F28xxSerialBoot.out" );
        }

		// Build the file path for the password match flow download.
		// SDflash does not have a dialog box in which to enter the filename.
		// To get around this, use the same path as PrgFlashDataFileName, and
		// append the filename to that path.

		strcpy( PrgPasswordMFPath, Opts.PrgBootLoadFileName );		// Copy the inputed path to the working string

		for(i=strlen(PrgPasswordMFPath); i>0; i--)					// Search for the last backslash in the path
		{
			if(PrgPasswordMFPath[i] == '\\')						// Found the last backslash
			{
				i++;												// Advance to character after the backslash
				break;												// Break out of the loop
			}
		}															// If no backslash found, loop will terminate at 1st character.  This
																	// means no path was specified, just a filename.  So, we will replace
																	// the filename with the password match flow filename.

		PrgPasswordMFPath[i] = '\0';								// Replace the character after the last backslash with the null character
		strcat( PrgPasswordMFPath, PrgPasswordMFFileName );			// Append the filename to the path

        // Load the Password Match Flow code image.
        Error = LoadBootCoffImage( PrgPasswordMFPath );
		SioClose();

        if( Error )
        {
            TestPutDiagMsg("Failed to load password match flow code.\n");
            goto EXIT_PrgOpen;
        }

        // Give the application time to startup then reconnect
        Sleep( 1000 );
		Error =  SioOpen( PortName, Baud );

		if( Error )
        {
            TestPutDiagMsg("Could not open serial port %s at %d baudrate\n", PortName, Opts.EmuBaudRate );
            goto EXIT_PrgOpen;
        }

