UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
        // Autobaud to get target connected to correct baudrate
        Error = SioAutoBaud( Baud );
        if( Error )
        {
            TestPutDiagMsg("Autobaud failed after loading application\n" );
            goto EXIT_PrgOpen;
        }

        // Load the boot image
        Error = LoadBootCoffImage(  Opts.PrgBootLoadFileName );
		SioClose();

        if( Error )
        {
            TestPutDiagMsg("Failed to load boot code.\n");
            goto EXIT_PrgOpen;
        }

        // Give the application time to startup then reconnect
        Sleep( 1000 );
	    Error =  SioOpen( PortName, Baud );
	    if( Error )
        {
            TestPutDiagMsg("Could not open serial port %s at %d baudrate\n", PortName, Opts.EmuBaudRate );
            goto EXIT_PrgOpen;
        }

        // Autobaud to get target connected to correct baudrate
        Error = SioAutoBaud( Baud );
        if( Error )
        {
            TestPutDiagMsg("Autobaud failed after loading application\n" );
            goto EXIT_PrgOpen;
        }

        // We are sending stream of '0' to clear any trash in the com channel.
        // Target will simply ignore these as invalid messages
        memset(SendBuf,0,sizeof(SendBuf));
        SioSendMsg( SendBuf, MSG_HEADER_SIZE );

        Sleep(300);
        SioPurgeComm();

        // If successfull bootload set the PrgSkipBootLoad = TRUE.  This allows
        // us to skip the bootload for subsequent calls.  The user can override
        // this by calling set options to reenable or by closing and recalling
        // PRG_Init().
        Opts.PrgSkipBootLoad = TRUE;
    }
    else
    {
        // If we are skipping  the bootload ping the channel to make sure
        // we can send/recv commands.
        Error = PingChannel();
        if( Error )
            goto EXIT_PrgOpen;
    }

    Connected = 1;
    TestPutDiagMsg("Connected to %s at %d baud\n",PortName,Opts.EmuBaudRate );

    Success = PRG_SUCCESS;

EXIT_PrgOpen:
    ExeStatus = Success;

#if defined( USE_THREADS )
    _endthreadex( Success );
#endif

}

/*F***************************************************************************
* NAME: int PRG_Open( DWORD Handle )
*
* DESCRIPTION:  Wrapper function for PrgOpen.
*
* NOTES:  Suppport thread and non-thread mode.
*
*F***************************************************************************/
EXPORT int
PRG_Open( DWORD Handle )
{
    // Open is done from a thread due to length of time required.
    // Generally speaking this includes doing the boot load which
    // is slow.
    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

#if defined( USE_THREADS )
        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)PrgOpen,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);
        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        // ExeStatus is set by PrgOpen
        PrgOpen( Handle );
#endif

    }

    return( ExeStatus );

}
/*F***************************************************************************
* NAME: int PRG_Close( DWORD Handle )
*
* DESCRIPTION:  Close the communication channel.
*
* NOTES:  Supports thread and non-thread
*
*F***************************************************************************/
EXPORT int
PRG_Close( DWORD Handle )
{

    DWORD ThreadState;
    int   TimeOut = 15;

    ThreadTerminate = TRUE;

#if defined( USE_THREADS )
    // If there is a thread running then wait for it to close. This is here
    // so that user could call a close even though an action is still active.
    // This is necessary to support the "Stop" button in SDFlash.
    while( ( ThreadHandle != 0 ) && ( TimeOut-- != 0) )
    {
        ThreadState = WaitForSingleObject( (HANDLE)ThreadHandle, 1000 );

        if( ThreadState != WAIT_TIMEOUT )
            ThreadHandle = 0;

    }
#endif

    // Close the serial port and clear the connect flag.  We do NOT
    // modify the options as these can be used by another open.
    //
    SioClose();
    Connected = 0;
    return( PRG_SUCCESS );
}
/*F***************************************************************************
* NAME: int PRG_SetMessageCallBack( DWORD Handle,
*                                   PRG_MESSAGE_CALLBACK pMsgCallBack )
*
* DESCRIPTION:  Install a message callback so that errors/status messages
*               can be passed back.
*
* NOTES:
*
*F***************************************************************************/
EXPORT int
PRG_SetMessageCallBack( DWORD Handle, PRG_MESSAGE_CALLBACK pMsgCallBack )
{

    // This does not provide any output for SDFlash but is usefull for
    // command line
    //
    pfTestPrintMsg = pMsgCallBack;
    if( pfTestPrintMsg != NULL )
        pfTestPrintMsg(Handle, 0, "Installed output message callback\n" );

    return( PRG_SUCCESS );
}


/*F***************************************************************************
* NAME: void PrgFlashErase( DWORD Handle )
*
* DESCRIPTION:  Erase the flash
*
* NOTES:  Supports thread and non-thread.
*
*F***************************************************************************/
EXPORT void
PrgFlashErase( DWORD Handle )
{
    int     Error    = 0;
    char    *pSbuf;
    char    *pRbuf;
    int     CmdErr;
    int     NumSections;
    int     i;
	DWORD   Retries;
    long    SleepTime;

    DWORD   NumXfer;
    int     Success = PRG_FAIL;

    if( Connected == 0 )
        goto EXIT_PrgFlashErase;

    // Counting the number of sections to erase is F28xx specific.
    NumSections = 1; // Minimum
    for(i=1; i<16; i++ )
        NumSections += ((Opts.PrgEraseOption1>>i ) & 1);

    SleepTime = ERASE_TIMEOUT(NumSections);

    pSbuf = SendBuf;
    Put16(pSbuf,CMD_FLASH_ERASE );// Cmd
    Put32(pSbuf,0);            // Addr
    Put16(pSbuf,0);            // Page
    Put16(pSbuf,0);            // Length
    Put16(pSbuf,Opts.PrgEraseOption1);  // PRG_option1
    Put16(pSbuf,Opts.PrgEraseOption2);  // PRG_option2
    Put16(pSbuf,Opts.PrgEraseOption3);  // PRG_option3
    Put16(pSbuf,Opts.PrgEraseOption4);  // PRG_option4
    Put16(pSbuf,-1 );          // Status

    NumXfer = PktSendMsg( SendBuf,SIZE_COMMAND_BLOCK  );
    if( NumXfer == 0 )
    {
        TestPutDiagMsg("Send packet rejected\n");
        goto EXIT_PrgFlashErase;
    }

