UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
    // Sleep for short time and then wake up to see if application has
    // requested us to terminate.  The terminate request is in PRG_Close.
    // Common code can be used for thread and non-thread.  ThreadTerminate
    // can never be TRUE in non-thread mode.
    do
    {
        if( ThreadTerminate == TRUE )
            goto EXIT_PrgFlashErase;
        else
            Sleep(SLEEP_INTERVAL);
        SleepTime -= SLEEP_INTERVAL;

    }while( SleepTime > 0 );

    // Wait for return status.  Should get back 1 status word
	Retries = Opts.PrgEraseOption4;
	do
    {
		NumXfer = PktRecvMsg( RecvBuf, MSG_BODY_SIZE );
	    if( NumXfer >= 2 )
	    {
	        pRbuf = RecvBuf;
	        Get16(pRbuf,CmdErr);
			Retries = 0;			// Done with loop (return status received)
	    }
	    else
		{
	        CmdErr = -1;
		}
	}while(Retries-- > 0);			// Exit loop when # retries is exceeded or when return status is received


    if( CmdErr != 0 )
    {
        TestPutDiagMsg("Erase Failed\n");
        goto EXIT_PrgFlashErase;
    }

    Success = PRG_SUCCESS;

EXIT_PrgFlashErase:
    ExeStatus = Success;

#if defined( USE_THREADS )
    _endthreadex( Success );
#endif

}

/*F***************************************************************************
* NAME:  int  PRG_FlashErase( DWORD Handle )
*
* DESCRIPTION:  Wrapper function for PrgFlashErase()
*
* NOTES:  Suppports thread and non-thread.
*
*F***************************************************************************/
EXPORT int
PRG_FlashErase( DWORD Handle )
{
    // Flash Erase is done from a thread due to length of time required.
    //
    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

#if defined( USE_THREADS )
        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)PrgFlashErase,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);

        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        // ExeStatus is set by PrgFlashErase
        PrgFlashErase(Handle );
#endif
    }

    return( ExeStatus );
}

/*F***************************************************************************
* NAME:  int MemWrite( DWORD Handle, DWORD Addr, DWORD Page,
*                      DWORD NumBytes, char *pData, DWORD Command )
*
* DESCRIPTION: Writes to target RAM.
*
* NOTES:  Function supports writing to NON-FLASH memory.
*         The data is an 8-bit byte stream and the count is the number
*         of 8-bit bytes to transfer.  It is up to caller and target
*         code implementer to agree on byte ordering and alignment.
*         For SDFLASH the following apply:
*             - Data is passed in host endianess format.
*             - Byte count is in multiples of minimum address unit.
*                  Thus a 16 bit F28xx would always get a count that
*                  is multiple of 16 bits or 2 8-bit bytes.
*
*         This function is called by other functions that setup memory
*         for flash commands.  The "Command" value is the target operation
*         to be performed.
*
*F***************************************************************************/
static void
MemWrite( DWORD Handle )
{
    int     Error    = 0;
    char    *pSbuf;
    char    *pRbuf;
    int     CmdErr;
    DWORD   i;
    DWORD   Retries;

    DWORD   NumToSend;
    DWORD   NumXfer;
    DWORD   MaxXfer      = SIZE_FLASH_DATA & ~1;  // Even #bytes
    DWORD   Taddr        = MemAddr;
    DWORD   NumBytesSend = 0;
    unsigned short * p16 = (unsigned short *)pMemData;
    DWORD   SleepTime;
    int     Success = PRG_FAIL;

    if(    ( Connected == 0 )
        || ( pMemData == NULL ))
        goto EXIT_MemWrite;

    MemBytes &= ~1; // Must be even #bytes

    // Idiot proof
    if( MemBytes == 0 )
        goto EXIT_MemWrite;

    while( NumBytesSend < MemBytes )
    {
        NumToSend =   ((MemBytes - NumBytesSend) > MaxXfer )
                       ? MaxXfer : (MemBytes - NumBytesSend);


        if( MemCmd == CMD_FLASH_PROGRAM )
            SleepTime = PROGRAM_TIMEOUT(NumToSend);
        else
            SleepTime = MEMORY_TIMEOUT(NumToSend);


        pSbuf = SendBuf;
        Put16(pSbuf,MemCmd );      // Cmd
        Put32(pSbuf,Taddr);        // Addr
        Put16(pSbuf,MemPage);      // Page
        Put16(pSbuf,(NumToSend/2)); // Length in target words
        if( MemCmd == CMD_FLASH_PROGRAM )
        {
            Put16(pSbuf,Opts.PrgProgrammingOption1);  // PRG_option1
            Put16(pSbuf,Opts.PrgProgrammingOption2);  // PRG_option2
            Put16(pSbuf,Opts.PrgProgrammingOption3);  // PRG_option3
            Put16(pSbuf,Opts.PrgProgrammingOption4);  // PRG_option4
        }
        else
        {
            Put16(pSbuf,0);            // PRG_option1
            Put16(pSbuf,0);            // PRG_option2
            Put16(pSbuf,0);            // PRG_option3
            Put16(pSbuf,0);            // PRG_option4
        }
        Put16(pSbuf,-1 );          // Status

        for(i=0;i<(NumToSend/2);i++)
        {
            Put16(pSbuf,*p16);
            p16++;
        }

        NumXfer = PktSendMsg( SendBuf,SIZE_COMMAND_BLOCK+NumToSend  );
        if( NumXfer == 0 )
        {
            TestPutDiagMsg("Send packet rejected\n");
            goto EXIT_MemWrite;
        }

        Sleep( SleepTime );

        // Wait for return status.  Should get back 1 status word
		Retries = Opts.PrgProgrammingOption4;
		do
	    {
			NumXfer = PktRecvMsg( RecvBuf, MSG_BODY_SIZE );
		    if( NumXfer >= 2 )
		    {
		        pRbuf = RecvBuf;
		        Get16(pRbuf,CmdErr);
				Retries = 0;			// Done with loop (return status received)
		    }
		    else
			{
		        CmdErr = -1;
			}
		}while(Retries-- > 0);			// Exit loop when # retries is exceeded or when return status is received

        if( CmdErr != 0 )
        {
            TestPutDiagMsg("Write Failed, Address = %08lx, Error = %d\n",Taddr,CmdErr);
            goto EXIT_MemWrite;
        }


