UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP280x_v3_3/DSP280x_serial/src_host/f280xxprg.c
        NumBytesSend += NumToSend;
        // Note there are two bytes per Taddr
        Taddr += (NumToSend/2);

        if( ThreadTerminate == TRUE )
            goto EXIT_MemWrite;

    }
    // No errors so set success
    Success = PRG_SUCCESS;

EXIT_MemWrite:
    ExeStatus = Success;

#if defined( USE_THREADS )
    if( pMemData != NULL )
    {
        free( pMemData );
        pMemData = NULL;
    }
    _endthreadex( Success );
#endif
}
/*F***************************************************************************
* NAME:  int MemRead( DWORD Handle, DWORD Addr, DWORD Page,
*                      DWORD NumBytes, char *pData, DWORD Command )
*
* DESCRIPTION: Reads target memory.  Supports thread and non-thread.
*
* NOTES:  Function supports reading to ALL memory.
*         The data is an 8-bit byte stream and the count is the number
*         of 8-bit bytes to transfer.  It is up to caller and target
*         code implementer to agree on byte ordering and alignment.
*         For SDFLASH the following apply:
*             - Data is passed in host endianess format.
*             - Byte count is in multiples of minimum address unit.
*                  Thus a 16 bit F28xx would always get a count that
*                  is multiple of 16 bits or 2 8-bit bytes.
*
*         This function is called by other functions that setup memory
*         for flash commands.  The "Command" value is the target operation
*         to be performed.
*
*F***************************************************************************/
static void
MemRead( DWORD Handle )
{
    int     Error    = 0;
    char    *pSbuf;
    char    *pRbuf;
    DWORD   i;
    DWORD   NumToReceive;
    DWORD   ActualReceive;
    DWORD   NumXfer;
    DWORD   MaxXfer      = (SIZE_FLASH_DATA-2) & ~1;
    DWORD   Taddr        = MemAddr;
    DWORD   NumBytesRead = 0;
    unsigned short * p16 = (unsigned short *)pMemData;
    DWORD   SleepTime;

    int     Success = PRG_FAIL;

    if( Connected == 0 )
        goto EXIT_MemRead;

    MemBytes &= ~1; // Must be even #bytes

    // Idiot proof
    if( MemBytes == 0 )
        goto EXIT_MemRead;

    while( NumBytesRead < MemBytes )
    {
        NumToReceive =   ((MemBytes - NumBytesRead) > MaxXfer )
                       ? MaxXfer : (MemBytes - NumBytesRead);


        // No real delay for flash vs memory
        SleepTime = MEMORY_TIMEOUT(NumToReceive);

        pSbuf = SendBuf;
        Put16(pSbuf,MemCmd );      // Cmd
        Put32(pSbuf,Taddr);        // Addr
        Put16(pSbuf,MemPage);      // Page
        Put16(pSbuf,NumToReceive/2);// Length
        Put16(pSbuf,0);            // PRG_option1
        Put16(pSbuf,0);            // PRG_option2
        Put16(pSbuf,0);            // PRG_option3
        Put16(pSbuf,0);            // PRG_option4
        Put16(pSbuf,-1 );          // Status

        NumXfer = PktSendMsg( SendBuf, SIZE_COMMAND_BLOCK );
        if( NumXfer == 0 )
        {
            TestPutDiagMsg("Send packet rejected\n");
            goto EXIT_MemRead;
        }

        Sleep( SleepTime );

        // Should read back the data + 1 status word.  Status word
        // is the first value.
        ActualReceive = PktRecvMsg( RecvBuf, MSG_BODY_SIZE );

        if( ActualReceive >= 2 )
            ActualReceive -=2;

        if( ActualReceive > 0 )
        {
            // Offset past status word
            pRbuf = &RecvBuf[2];
            for(i=0;i<(ActualReceive/2);i++)
            {
                Get16(pRbuf,*p16);
                p16++;
            }
        }
        else
        {
            TestPutDiagMsg("Failed data receive\n");
            goto EXIT_MemRead;
        }

        NumBytesRead += ActualReceive;
        // Note there are two bytes per Taddr
        Taddr += (ActualReceive/2);

        // Sleep for short time and then wake up to see if application has
        // requested us to terminate.  The terminate request is in PRG_Close.
        // Common code can be used for thread and non-thread.  ThreadTerminate
        // can never be TRUE in non-thread mode.

        if( ThreadTerminate == TRUE )
            goto EXIT_MemRead;
    }
    // No errors so set success
    Success = PRG_SUCCESS;

EXIT_MemRead:
    ExeStatus = Success;

#if defined( USE_THREADS )
    _endthreadex( Success );
#endif
}

// The following functions are simply wrappers which specify with memory
// "Command" to execute.
//
EXPORT int
PRG_FlashWrite( DWORD Handle, DWORD Addr, DWORD Page, DWORD NumBytes, char *pData )
{
    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

        MemAddr  = Addr;
        MemPage  = Page;
        MemBytes = NumBytes;
        MemCmd   = CMD_FLASH_PROGRAM;

#if defined( USE_THREADS )
        // Malloc buffer to copy data as we cannot assume caller does not
        // relase data before we are done.
        if( pMemData == NULL )
        {
            pMemData = (char *)malloc(NumBytes);
            if( pMemData != NULL )
                memcpy( pMemData, pData, NumBytes );
        }

        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)MemWrite,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);

        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        pMemData = pData;
        // ExeStatus is set by MemWrite
        MemWrite( Handle );
#endif
    }
    return( ExeStatus );
}

EXPORT int
PRG_MemWrite( DWORD Handle, DWORD Addr, DWORD Page, DWORD NumBytes, char *pData )
{

    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

        MemAddr  = Addr;
        MemPage  = Page;
        MemBytes = NumBytes;

        MemCmd   = CMD_MEM_WRITE;

#if defined( USE_THREADS )
        // Malloc buffer to copy data as we cannot assume caller does not
        // relase data before we are done.
        if( pMemData == NULL )
        {
            pMemData = (char *)malloc(NumBytes);
            if( pMemData != NULL )
                memcpy( pMemData, pData, NumBytes );
        }
        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)MemWrite,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);

        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        pMemData = pData;
        // ExeStatus is set by MemWrite
        MemWrite( Handle );
#endif
    }
    return( ExeStatus );
}

